101/system_initialization/uefi.org
#+title: UEFI
#+author: Gabriel Feerreira

* UEFI Unified Extensible Firmware Interface

Firmware desenvolvido para substituir a BIOS, utiliza partição GPT, diferente da BIOS que utiliza a MBR

 * Secure boot
 * Velocidade de boot
 * Módulo de suporte à compatibilidade
 * ESP (EFI System Partition)
 * Suporte a disco com mais de 2TB

* Processo de inicialização com UEFI

**** UEFI
Computador ligado
UEFI executado
UEFI carrega o bootloader da partição ESP (EFI System Partition)

**** BootLoader
Bootloader exibe a tela de seleção do sistema
Carrega o kernal linux e a imagen initrd
Passa o controle da inicialização para o kernel Linux

**** Kernel
Reconhece o hardware
Monta a partição que contém o conteúdo do diretório Raiz
Passa o controle para o primeiro programa: Init / SystemD

**** Init/SystemD
Inicia todos os serviços configurados no runlevel ou target
