101/system_initialization/uefi.txt
                          ━━━━━━━━━━━━━━━━━━━
                                  UEFI

                           Gabriel Feerreira
                          ━━━━━━━━━━━━━━━━━━━


Table of Contents
─────────────────

1. UEFI Unified Extensible Firmware Interface
2. Processo de inicialização com UEFI


1 UEFI Unified Extensible Firmware Interface
════════════════════════════════════════════

  Firmware desenvolvido para substituir a BIOS, utiliza partição GPT,
  diferente da BIOS que utiliza a MBR

  ‣ Secure boot
  ‣ Velocidade de boot
  ‣ Módulo de suporte à compatibilidade
  ‣ ESP (EFI System Partition)
  ‣ Suporte a disco com mais de 2TB


2 Processo de inicialização com UEFI
════════════════════════════════════

◊ 2.0.0.1 UEFI

  Computador ligado UEFI executado UEFI carrega o bootloader da partição
  ESP (EFI System Partition)


◊ 2.0.0.2 BootLoader

  Bootloader exibe a tela de seleção do sistema Carrega o kernal linux e
  a imagen initrd Passa o controle da inicialização para o kernel Linux


◊ 2.0.0.3 Kernel

  Reconhece o hardware Monta a partição que contém o conteúdo do
  diretório Raiz Passa o controle para o primeiro programa: Init /
  SystemD


◊ 2.0.0.4 Init/SystemD

  Inicia todos os serviços configurados no runlevel ou target
